[
    "The only way to do great work is to love what you do. - Steve Jobs",
    "Programming isn't about what you know; it's about what you can figure out. - Chris Pine",
    "Code is like humor. When you have to explain it, it's bad. - Cory House",
    "The best way to predict the future is to invent it. - Alan Kay",
    "Simplicity is the soul of efficiency. - Austin Freeman",
    "In programming, the hard part isn't solving problems, but deciding what problems to solve. - Paul Graham",
    "First, solve the problem. Then, write the code. - John Johnson",
    "Experience is the name everyone gives to their mistakes. - Oscar Wilde",
    "Talk is cheap. Show me the code. - Linus Torvalds",
    "Any fool can write code that a computer can understand. Good programmers write code that humans can understand. - Martin Fowler",
    "Programming is not about typing, it's about thinking. - Rich Hickey",
    "The most important property of a program is whether it accomplishes the intention of its user. - C.A.R. Hoare",
    "Debugging is twice as hard as writing the code in the first place. - Brian Kernighan",
    "Make it work, make it right, make it fast. - Kent Beck",
    "Premature optimization is the root of all evil. - Donald Knuth",
    "Code never lies, comments sometimes do. - Ron Jeffries",
    "Programs must be written for people to read, and only incidentally for machines to execute. - Harold Abelson",
    "The best error message is the one that never shows up. - Thomas Fuchs",
    "It's not a bug – it's an undocumented feature. - Anonymous",
    "Programming is the art of algorithm design and the craft of debugging errant code. - Ellen Ullman",
    "Learning to write programs stretches your mind, and helps you think better. - Bill Gates",
    "Every great developer you know got there by solving problems they were unqualified to solve until they actually did it. - Patrick McKenzie",
    "The function of good software is to make the complex appear to be simple. - Grady Booch",
    "Software is a great combination between artistry and engineering. - Bill Gates",
    "Clean code always looks like it was written by someone who cares. - Robert C. Martin",
    "Code is read much more often than it is written. - Guido van Rossum",
    "The only way to learn a new programming language is by writing programs in it. - Dennis Ritchie",
    "Simplicity is prerequisite for reliability. - Edsger W. Dijkstra",
    "Good code is its own best documentation. - Steve McConnell",
    "Programming is not a science. Programming is a craft. - Richard Stallman",
    "Don't comment bad code—rewrite it. - Brian Kernighan",
    "Measuring programming progress by lines of code is like measuring aircraft building progress by weight. - Bill Gates",
    "Always code as if the guy who ends up maintaining your code will be a violent psychopath who knows where you live. - Martin Golding",
    "There are only two hard things in Computer Science: cache invalidation and naming things. - Phil Karlton",
    "Walking on water and developing software from a specification are easy if both are frozen. - Edward V Berard",
    "Programming today is a race between software engineers striving to build bigger and better idiot-proof programs, and the Universe trying to produce bigger and better idiots. - Rick Cook",
    "The computer was born to solve problems that did not exist before. - Bill Gates",
    "The best thing about a boolean is even if you are wrong, you are only off by a bit. - Anonymous",
    "If debugging is the process of removing software bugs, then programming must be the process of putting them in. - Edsger Dijkstra",
    "Programming is like sex. One mistake and you have to support it for the rest of your life. - Michael Sinz",
    "It's not that I'm so smart, it's just that I stay with problems longer. - Albert Einstein",
    "Success is not final, failure is not fatal: it is the courage to continue that counts. - Winston Churchill",
    "The way to get started is to quit talking and begin doing. - Walt Disney",
    "Innovation distinguishes between a leader and a follower. - Steve Jobs",
    "Your limitation—it's only your imagination.",
    "Push yourself, because no one else is going to do it for you.",
    "Great things never come from comfort zones.",
    "Dream it. Wish it. Do it.",
    "Don't stop when you're tired. Stop when you're done.",
    "Wake up with determination. Go to bed with satisfaction."
]
